#+SETUPFILE: ../setup_laminas.org
#+TITLE: Planificación de procesos: Algoritmos de planificación
#+DATE: 2013-09-24 — 2013-10-03

** Resultado de nuestro ejemplo
#+begin_center
| Proceso         | $t$ |  $T$ |   $E$ |  $P$ |   $R$ |
|-----------------+-----+------+-------+------+-------|
| $A$             |   7 |   18 |    11 | 2.57 | 0.389 |
| $B$             |   3 |    7 |     4 | 2.33 | 0.429 |
| $C$             |  12 |   26 |    14 | 2.17 | 0.462 |
| $D$             |   4 |    9 |     5 | 2.25 | 0.444 |
| Promedio /útil/ | 6.5 |   15 |  8.50 | 2.31 | 0.433 |
|-----------------+-----+------+-------+------+-------|
| Núcleo          |   6 |   32 |    26 | 5.33 | 0.188 |
|-----------------+-----+------+-------+------+-------|
| Promedio total  | 6.4 | 18.4 | 12.00 | 2.88 | 0.348 |
#+TBLFM: @I$6..@IIII$6=($2/$3); EN f-3::@I$5..@IIII$5=($3/$2); EN f-2::@I$4..@IIII$4=($3-$2); EN f-2

- Tiempo kernel :: 14 /ticks/
- Tiempo desocupado :: 0 /ticks/
- Utilización del CPU :: 26 /ticks/
#+end_center

